{
    "FormatVersion": 2,
    "Namespace": "",
    "Children": [
        {
            "Source": {
                "Text": "1× Assembler · 2.5/min of 12.5 needed"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "AB46CACF4C402D0A0C2BBD8FB7B2500A"
        },
        {
            "Source": {
                "Text": "1× Manufacturer · 2.5/min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "3AE89A3A41716D0C1158828D998F52A4"
        },
        {
            "Source": {
                "Text": "2,000 needed  ·  2,000 banked  ·  deliver now"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "650C25414036AC525E39C79183343F3B"
        },
        {
            "Source": {
                "Text": "2× Assembler · 25/min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "FE02FE6043275C5F429266A6F006A805"
        },
        {
            "Source": {
                "Text": "2× Manufacturer · 5.0/min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "9614FDD644BF8B9EE29DE8A6D6732B2C"
        },
        {
            "Source": {
                "Text": "3 parts required  ·  1 ready to deliver  ·  1 blocked  ·  earliest completion ~72 min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "7F101E664166DBC1D99692B19B5313F2"
        },
        {
            "Source": {
                "Text": "480 needed  ·  120 banked  ·  360 to produce  ·  ~72 min"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "E8ACA03D49EB7261E197659531E32B6F"
        },
        {
            "Source": {
                "Text": "99 needed  ·  7 banked  ·  92 to produce  ·  blocked"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "3BE554254D343A7BBCA2B7B5A00AF90C"
        },
        {
            "Source": {
                "Text": "Adaptive Control Unit"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "08EBECCB41804E37453A4AAA1FD5F3E3"
        },
        {
            "Source": {
                "Text": "Automated Wiring"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "9EF74FE34AE569C38CA64E9D82C844A8"
        },
        {
            "Source": {
                "Text": "CRITICAL PATH"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "043B5BBC45C8B0568744889832C5FD6B"
        },
        {
            "Source": {
                "Text": "Modular Engine"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "E3B96B684DA94C6196E53B9E5EF65A3E"
        },
        {
            "Source": {
                "Text": "Space Elevator: Main Body"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "2523207949D893471F1C63BF2314EACE"
        },
        {
            "Source": {
                "Text": "Stator"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "F616D3404E39FA0AE068C5AD74FA8243"
        },
        {
            "Source": {
                "Text": "Versatile Framework"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "73F3C0684140FD63EC7EBF898F7BE8AD"
        },
        {
            "Source": {
                "Text": "no producer configured"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "B4DE02E8428694AE136D48822BF08AE1"
        },
        {
            "Source": {
                "Text": "×"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "1A0751FB44AC4366F8DF2BBCAF1BFF20"
        },
        {
            "Source": {
                "Text": "× BLOCKED — Adaptive Control Unit is stalled. Build a Stator line: it gates Automated Wiring → Adaptive Control Unit → Main Body."
            },
            "Translation": {
                "Text": ""
            },
            "Key": "C00C970340D208F8A377D2B6647BE15D"
        },
        {
            "Source": {
                "Text": "■"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "916D7FF44FD10ADF39543CA075B7F49A"
        },
        {
            "Source": {
                "Text": "▲"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "B93CDE3745A0108F118915A3EB4B3B18"
        },
        {
            "Source": {
                "Text": "▲"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "3D920FAE42B1D930C642E6933107B5CB"
        },
        {
            "Source": {
                "Text": "●"
            },
            "Translation": {
                "Text": ""
            },
            "Key": "29308E89411226D839FFDD9CFE508DF0"
        }
    ],
    "Subnamespaces": [
        {
            "Namespace": "CriticalPath",
            "Children": [
                {
                    "Source": {
                        "Text": "  ·  nearest endpoint {0} m away"
                    },
                    "Translation": {
                        "Text": "  ·  最近端点在 {0} 米外"
                    },
                    "Key": "BalanceDistanceFmt"
                },
                {
                    "Source": {
                        "Text": "ALL AUGMENTS"
                    },
                    "Translation": {
                        "Text": "全部增益"
                    },
                    "Key": "BalanceAugmentAll"
                },
                {
                    "Source": {
                        "Text": "ALL LINES"
                    },
                    "Translation": {
                        "Text": "全部生产线"
                    },
                    "Key": "BalanceProblemAll"
                },
                {
                    "Source": {
                        "Text": "AT FULL SPEED  needs {0}  ·  ingredients allow {1}  ·  would deliver {2}"
                    },
                    "Translation": {
                        "Text": "满速运行  需要 {0}  ·  原料仅支持 {1}  ·  可产出 {2}"
                    },
                    "Key": "BalanceDesignFmt"
                },
                {
                    "Source": {
                        "Text": "AWESOME Shop"
                    },
                    "Translation": {
                        "Text": "AWESOME Shop"
                    },
                    "Key": "SrcShop"
                },
                {
                    "Source": {
                        "Text": "Across the whole factory only {0}/min is available against {1}/min needed ({2}%) - this may be a different line"
                    },
                    "Translation": {
                        "Text": "整个工厂仅有 {0}/min 可用，而需求为 {1}/min（{2}%） - 这可能是另一条生产线"
                    },
                    "Key": "LimiterNetFmt"
                },
                {
                    "Source": {
                        "Text": "Already produced"
                    },
                    "Translation": {
                        "Text": "已生产"
                    },
                    "Key": "PlanGraft"
                },
                {
                    "Source": {
                        "Text": "Already produced - {0}"
                    },
                    "Translation": {
                        "Text": "已生产 - {0}"
                    },
                    "Key": "PlanGraftFmt"
                },
                {
                    "Source": {
                        "Text": "Arriving ingredients only support {0} of the {1} these machines could make"
                    },
                    "Translation": {
                        "Text": "到货原料仅支持 {0}，而这些机器本可生产 {1}"
                    },
                    "Key": "LimiterInputConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "Asking the host for a report"
                    },
                    "Translation": {
                        "Text": "正在向主机请求报告"
                    },
                    "Key": "AskingHostHeadline"
                },
                {
                    "Source": {
                        "Text": "Assumed recipe: {0}"
                    },
                    "Translation": {
                        "Text": "假定配方：{0}"
                    },
                    "Key": "PlanTipFmt"
                },
                {
                    "Source": {
                        "Text": "A–Z"
                    },
                    "Translation": {
                        "Text": "A–Z"
                    },
                    "Key": "BalanceSortAlphabetical"
                },
                {
                    "Source": {
                        "Text": "BALANCE"
                    },
                    "Translation": {
                        "Text": "产耗平衡"
                    },
                    "Key": "TabBalance"
                },
                {
                    "Source": {
                        "Text": "BELT JAMMED · {0} machine(s) blocked by {1} on the feeding belt - remove it; this is not a supply shortage"
                    },
                    "Translation": {
                        "Text": "传送带堵塞 · {0} 台机器被输入带上的 {1} 卡住 - 请移除它；这不是供应不足"
                    },
                    "Key": "BalanceJammedFmt"
                },
                {
                    "Source": {
                        "Text": "BLOCKED - the plan ({0} step(s)):"
                    },
                    "Translation": {
                        "Text": "受阻 - 计划（{0} 步）："
                    },
                    "Key": "VerdictPlanBlockedFmt"
                },
                {
                    "Source": {
                        "Text": "BLOCKED - {0} step(s) to deliver {1}"
                    },
                    "Translation": {
                        "Text": "受阻 - 还需 {0} 步才能交付 {1}"
                    },
                    "Key": "VerdictPlanBlockedDeliverFmt"
                },
                {
                    "Source": {
                        "Text": "BLOCKED - {0}: {1}."
                    },
                    "Translation": {
                        "Text": "受阻 - {0}：{1}。"
                    },
                    "Key": "VerdictBlockedFmt"
                },
                {
                    "Source": {
                        "Text": "BUFFER  {0} {1} reachable"
                    },
                    "Translation": {
                        "Text": "缓冲  可取用 {0} {1}"
                    },
                    "Key": "BufferAmountFmt"
                },
                {
                    "Source": {
                        "Text": "BUFFER  {0} {1} reachable  ·  about {2} min at the current shortfall"
                    },
                    "Translation": {
                        "Text": "缓冲  可取用 {0} {1}  ·  按当前缺口约可支撑 {2} 分钟"
                    },
                    "Key": "BufferRunwayFmt"
                },
                {
                    "Source": {
                        "Text": "BUILT CAPACITY"
                    },
                    "Translation": {
                        "Text": "已建产能"
                    },
                    "Key": "BalanceInstalled"
                },
                {
                    "Source": {
                        "Text": "Belt bottleneck: {0} → {1} carries {2} of {3}"
                    },
                    "Translation": {
                        "Text": "传送带瓶颈：{0} → {1} 运送 {2}，需 {3}"
                    },
                    "Key": "LimiterBeltConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "Bottleneck: {0}"
                    },
                    "Translation": {
                        "Text": "瓶颈：{0}"
                    },
                    "Key": "LimiterNameFmt"
                },
                {
                    "Source": {
                        "Text": "CLEAR PINGS"
                    },
                    "Translation": {
                        "Text": "清除标记"
                    },
                    "Key": "ClearPings"
                },
                {
                    "Source": {
                        "Text": "CONSUMER NEED"
                    },
                    "Translation": {
                        "Text": "消耗需求"
                    },
                    "Key": "BalanceDemand"
                },
                {
                    "Source": {
                        "Text": "CONSUMERS"
                    },
                    "Translation": {
                        "Text": "消耗方"
                    },
                    "Key": "BalanceConsumersHeading"
                },
                {
                    "Source": {
                        "Text": "CONSUMERS STOPPED · {0} machine(s) here would use {1}, but none of them are running"
                    },
                    "Translation": {
                        "Text": "消耗方已停止 · 此处 {0} 台机器本应使用 {1}，但没有一台在运行"
                    },
                    "Key": "BalanceConsumersStoppedFmt"
                },
                {
                    "Source": {
                        "Text": "CONSUMERS STOPPED · {0} machine(s) here would use {1}, but their own output is backed up"
                    },
                    "Translation": {
                        "Text": "消耗方已停止 · 此处 {0} 台机器本应使用 {1}，但它们自身的输出已堵塞"
                    },
                    "Key": "BalanceConsumersBlockedFmt"
                },
                {
                    "Source": {
                        "Text": "CRITICAL PATH"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "PanelTitle"
                },
                {
                    "Source": {
                        "Text": "Checking your factory…"
                    },
                    "Translation": {
                        "Text": "正在检查你的工厂…"
                    },
                    "Key": "BalancePending"
                },
                {
                    "Source": {
                        "Text": "Click to show/hide the blocker chain"
                    },
                    "Translation": {
                        "Text": "点击以显示/隐藏阻塞链"
                    },
                    "Key": "TipChainHint"
                },
                {
                    "Source": {
                        "Text": "Could not measure what is arriving - check the belts and pipes feeding this"
                    },
                    "Translation": {
                        "Text": "无法测量到货量 - 请检查供给此处的传送带和管道"
                    },
                    "Key": "BlockSolvedConnectivityUnknown"
                },
                {
                    "Source": {
                        "Text": "Critical Path could not find a player to ask the host on behalf of."
                    },
                    "Translation": {
                        "Text": "Critical Path 找不到可代其向主机发起请求的玩家。"
                    },
                    "Key": "NoControllerDetail"
                },
                {
                    "Source": {
                        "Text": "Current milestone is fully paid - collect it and select the next one at the HUB."
                    },
                    "Translation": {
                        "Text": "当前里程碑已付清 - 请在 HUB 领取并选择下一个。"
                    },
                    "Key": "MilestonePaid"
                },
                {
                    "Source": {
                        "Text": "Delivered"
                    },
                    "Translation": {
                        "Text": "已交付"
                    },
                    "Key": "StatusDelivered"
                },
                {
                    "Source": {
                        "Text": "Delivered: all {0}"
                    },
                    "Translation": {
                        "Text": "已交付：全部 {0}"
                    },
                    "Key": "TipDeliveredFmt"
                },
                {
                    "Source": {
                        "Text": "Delivery rates are not available right now. Machine status and built capacity are shown below."
                    },
                    "Translation": {
                        "Text": "当前无法获取交付速率。下方显示机器状态与已建产能。"
                    },
                    "Key": "BalanceUnknown"
                },
                {
                    "Source": {
                        "Text": "EST. CURRENT OUTPUT"
                    },
                    "Translation": {
                        "Text": "预估当前产量"
                    },
                    "Key": "BalanceEstimatedOutput"
                },
                {
                    "Source": {
                        "Text": "EST. CURRENT USE"
                    },
                    "Translation": {
                        "Text": "预估当前用量"
                    },
                    "Key": "BalanceEstimatedUse"
                },
                {
                    "Source": {
                        "Text": "Elevator"
                    },
                    "Translation": {
                        "Text": "太空电梯"
                    },
                    "Key": "SectionElevatorNone"
                },
                {
                    "Source": {
                        "Text": "Elevator: {0}"
                    },
                    "Translation": {
                        "Text": "太空电梯：{0}"
                    },
                    "Key": "SectionElevatorFmt"
                },
                {
                    "Source": {
                        "Text": "Every line feeding your objective: what it makes, what arrives, and how long your stock lasts."
                    },
                    "Translation": {
                        "Text": "为你的目标供货的每条生产线：产出什么、到货多少，以及库存能撑多久。"
                    },
                    "Key": "BalanceIntro"
                },
                {
                    "Source": {
                        "Text": "Extraction {0}/min vs demand {1}/min - add or upgrade extractors"
                    },
                    "Translation": {
                        "Text": "开采 {0}/min 对需求 {1}/min - 请增加或升级开采设备"
                    },
                    "Key": "BlockExtractFmt"
                },
                {
                    "Source": {
                        "Text": "HUB"
                    },
                    "Translation": {
                        "Text": "HUB"
                    },
                    "Key": "SrcTutorial"
                },
                {
                    "Source": {
                        "Text": "It is being made, but no belt or pipe connects it to what needs it"
                    },
                    "Translation": {
                        "Text": "它正在被生产，但没有传送带或管道把它连到需要它的地方"
                    },
                    "Key": "BlockNotConnected"
                },
                {
                    "Source": {
                        "Text": "JAMMED"
                    },
                    "Translation": {
                        "Text": "堵塞"
                    },
                    "Key": "BalanceProblemJammed"
                },
                {
                    "Source": {
                        "Text": "LOCATE"
                    },
                    "Translation": {
                        "Text": "定位"
                    },
                    "Key": "LocateEndpoint"
                },
                {
                    "Source": {
                        "Text": "LOCATE CONSUMER"
                    },
                    "Translation": {
                        "Text": "定位消耗方"
                    },
                    "Key": "LocateConsumer"
                },
                {
                    "Source": {
                        "Text": "LOCATE PRODUCER"
                    },
                    "Translation": {
                        "Text": "定位生产方"
                    },
                    "Key": "LocateProducer"
                },
                {
                    "Source": {
                        "Text": "Line exists but is STOPPED - fix it"
                    },
                    "Translation": {
                        "Text": "生产线已存在但已停止 - 请修复"
                    },
                    "Key": "PlanGraftStopped"
                },
                {
                    "Source": {
                        "Text": "Line exists but is STOPPED - fix the {0}"
                    },
                    "Translation": {
                        "Text": "生产线已存在但已停止 - 请修复 {0}"
                    },
                    "Key": "PlanGraftStoppedFmt"
                },
                {
                    "Source": {
                        "Text": "MACHINE STATUS ONLY · delivery rates are not available right now"
                    },
                    "Translation": {
                        "Text": "仅显示机器状态 · 当前无法获取交付速率"
                    },
                    "Key": "BalancePartialEvidence"
                },
                {
                    "Source": {
                        "Text": "MACHINES RUNNING SLOW · using about {0} of {1}; {2} machine(s) are short of ingredients"
                    },
                    "Translation": {
                        "Text": "机器运行缓慢 · 使用约 {0}（共 {1}）；{2} 台机器原料不足"
                    },
                    "Key": "BalanceObservedUseGapFmt"
                },
                {
                    "Source": {
                        "Text": "MAM"
                    },
                    "Translation": {
                        "Text": "MAM"
                    },
                    "Key": "SrcMAM"
                },
                {
                    "Source": {
                        "Text": "MISSING INPUT"
                    },
                    "Translation": {
                        "Text": "缺少原料"
                    },
                    "Key": "BalanceProblemStarved"
                },
                {
                    "Source": {
                        "Text": "Machine contents and storage are tracked by the host, so Critical Path is requesting the report from there. This can take a few seconds on a large factory."
                    },
                    "Translation": {
                        "Text": "机器内容与仓储由主机记录，因此 Critical Path 正在向主机请求报告。在大型工厂上这可能需要几秒钟。"
                    },
                    "Key": "AskingHostDetail"
                },
                {
                    "Source": {
                        "Text": "Machines here can make {0}; the machines using it need {1}"
                    },
                    "Translation": {
                        "Text": "此处的机器可生产 {0}；使用它的机器需要 {1}"
                    },
                    "Key": "LimiterInstalledConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "Milestone"
                    },
                    "Translation": {
                        "Text": "里程碑"
                    },
                    "Key": "SectionMilestoneNone"
                },
                {
                    "Source": {
                        "Text": "Milestone: {0}"
                    },
                    "Translation": {
                        "Text": "里程碑：{0}"
                    },
                    "Key": "SectionMilestoneFmt"
                },
                {
                    "Source": {
                        "Text": "NEED FIRST"
                    },
                    "Translation": {
                        "Text": "需求优先"
                    },
                    "Key": "BalanceSortNeedFirst"
                },
                {
                    "Source": {
                        "Text": "NEEDS ATTENTION"
                    },
                    "Translation": {
                        "Text": "需要关注"
                    },
                    "Key": "BalanceProblemAttention"
                },
                {
                    "Source": {
                        "Text": "NEXT - {0}: {1}."
                    },
                    "Translation": {
                        "Text": "下一步 - {0}：{1}。"
                    },
                    "Key": "VerdictNextFmt"
                },
                {
                    "Source": {
                        "Text": "NEXT STEPS - the plan ({0} step(s)):"
                    },
                    "Translation": {
                        "Text": "后续步骤 - 计划（{0} 步）："
                    },
                    "Key": "VerdictPlanHeadFmt"
                },
                {
                    "Source": {
                        "Text": "NEXT STEPS - {0} step(s) to deliver {1}"
                    },
                    "Translation": {
                        "Text": "后续步骤 - 还需 {0} 步交付 {1}"
                    },
                    "Key": "VerdictPlanDeliverFmt"
                },
                {
                    "Source": {
                        "Text": "NO POWER"
                    },
                    "Translation": {
                        "Text": "无电力"
                    },
                    "Key": "BalanceProblemNoPower"
                },
                {
                    "Source": {
                        "Text": "NOT ENOUGH ARRIVING · {0} is getting through; {1} is needed"
                    },
                    "Translation": {
                        "Text": "到货不足 · 实际通过 {0}；需要 {1}"
                    },
                    "Key": "BalanceModeledDeliveryGapFmt"
                },
                {
                    "Source": {
                        "Text": "NOT ENOUGH MACHINES · build at least {0} more production"
                    },
                    "Translation": {
                        "Text": "机器不足 · 至少再建造 {0}"
                    },
                    "Key": "BalanceCapacityGapFmt"
                },
                {
                    "Source": {
                        "Text": "NOT ENOUGH MACHINES · {0} short, and some machines are stopped as well"
                    },
                    "Translation": {
                        "Text": "机器不足 · 还缺 {0}，且部分机器也已停止"
                    },
                    "Key": "BalanceCapacityMachineGapsFmt"
                },
                {
                    "Source": {
                        "Text": "NOTHING IS USING THIS · it is only filling storage right now"
                    },
                    "Translation": {
                        "Text": "无人使用 · 目前只是在填满仓储"
                    },
                    "Key": "BalanceNoDemand"
                },
                {
                    "Source": {
                        "Text": "Needs a fix"
                    },
                    "Translation": {
                        "Text": "需要修复"
                    },
                    "Key": "StatusNeedsFix"
                },
                {
                    "Source": {
                        "Text": "No balance rows match this filter."
                    },
                    "Translation": {
                        "Text": "没有符合此筛选条件的产耗行。"
                    },
                    "Key": "BalanceNoMatches"
                },
                {
                    "Source": {
                        "Text": "No inputs arriving (check connections and supply)"
                    },
                    "Translation": {
                        "Text": "没有原料到货（请检查连接与供应）"
                    },
                    "Key": "BlockInputsStarved"
                },
                {
                    "Source": {
                        "Text": "No inputs arriving - {0} of {1} machine(s) starved (check connections and supply)"
                    },
                    "Translation": {
                        "Text": "没有原料到货 - {1} 台机器中有 {0} 台断料（请检查连接与供应）"
                    },
                    "Key": "BlockInputsStarvedFmt"
                },
                {
                    "Source": {
                        "Text": "No known source"
                    },
                    "Translation": {
                        "Text": "无已知来源"
                    },
                    "Key": "PlanUnknown"
                },
                {
                    "Source": {
                        "Text": "No line - build one"
                    },
                    "Translation": {
                        "Text": "无生产线 - 请建造一条"
                    },
                    "Key": "PlanLine"
                },
                {
                    "Source": {
                        "Text": "No line - build: {0}"
                    },
                    "Translation": {
                        "Text": "无生产线 - 请建造：{0}"
                    },
                    "Key": "PlanLineFmt"
                },
                {
                    "Source": {
                        "Text": "No line feeding your objective is in this state ({0}). Nothing to fix here."
                    },
                    "Translation": {
                        "Text": "没有为你的目标供货的生产线处于此状态（{0}）。这里无需修复。"
                    },
                    "Key": "BalanceNoProblemMatches"
                },
                {
                    "Source": {
                        "Text": "No line feeding your objective matches this filter."
                    },
                    "Translation": {
                        "Text": "没有为你的目标供货的生产线符合此筛选条件。"
                    },
                    "Key": "BalanceNoMatchesSearch"
                },
                {
                    "Source": {
                        "Text": "No milestone selected - {0} available. Choose one at the HUB."
                    },
                    "Translation": {
                        "Text": "未选择里程碑 - 有 {0} 个可选。请在 HUB 选择一个。"
                    },
                    "Key": "MilestoneNoneSelectedFmt"
                },
                {
                    "Source": {
                        "Text": "No milestones available in this elevator phase."
                    },
                    "Translation": {
                        "Text": "此太空电梯阶段没有可用的里程碑。"
                    },
                    "Key": "MilestoneNoneAvailable"
                },
                {
                    "Source": {
                        "Text": "No outstanding Space Elevator phase."
                    },
                    "Translation": {
                        "Text": "没有待完成的太空电梯阶段。"
                    },
                    "Key": "ElevatorNone"
                },
                {
                    "Source": {
                        "Text": "No outstanding objectives."
                    },
                    "Translation": {
                        "Text": "没有待完成的目标。"
                    },
                    "Key": "VerdictNone"
                },
                {
                    "Source": {
                        "Text": "No power - {0} of {1} machine(s) dark"
                    },
                    "Translation": {
                        "Text": "无电力 - {1} 台机器中有 {0} 台断电"
                    },
                    "Key": "BlockNoPowerCountFmt"
                },
                {
                    "Source": {
                        "Text": "No recipe by design - spent fuel: burn {0} in a Nuclear Power Plant"
                    },
                    "Translation": {
                        "Text": "设计上没有配方 - 乏燃料：在核电站中燃烧 {0}"
                    },
                    "Key": "GapSpentFuelFmt"
                },
                {
                    "Source": {
                        "Text": "Not built yet"
                    },
                    "Translation": {
                        "Text": "尚未建造"
                    },
                    "Key": "StatusNotBuilt"
                },
                {
                    "Source": {
                        "Text": "Not built yet"
                    },
                    "Translation": {
                        "Text": "尚未建造"
                    },
                    "Key": "StatusNotBuiltDefault"
                },
                {
                    "Source": {
                        "Text": "Not connected to a game"
                    },
                    "Translation": {
                        "Text": "未连接到游戏"
                    },
                    "Key": "NoControllerHeadline"
                },
                {
                    "Source": {
                        "Text": "Nothing on your objective path has a production line yet."
                    },
                    "Translation": {
                        "Text": "你的目标路径上尚无任何生产线。"
                    },
                    "Key": "BalanceEmpty"
                },
                {
                    "Source": {
                        "Text": "Nothing produces it - build a line"
                    },
                    "Translation": {
                        "Text": "没有任何设施生产它 - 请建造一条生产线"
                    },
                    "Key": "BlockNoProducer"
                },
                {
                    "Source": {
                        "Text": "ON TRACK - ~{0} min of production remain ({1} is the long pole)."
                    },
                    "Translation": {
                        "Text": "进度正常 - 还需约 {0} 分钟生产（{1} 是最慢的一环）。"
                    },
                    "Key": "VerdictEtaFmt"
                },
                {
                    "Source": {
                        "Text": "Only {0}/min is available for {1}/min needed ({2}%); some delivery routes could not be checked"
                    },
                    "Translation": {
                        "Text": "仅有 {0}/min 可用，而需求为 {1}/min（{2}%）；部分交付路线无法检查"
                    },
                    "Key": "LimiterAggFmt"
                },
                {
                    "Source": {
                        "Text": "Only {0}/min is getting through; the machines on this line need {1}/min ({2}%)"
                    },
                    "Translation": {
                        "Text": "仅有 {0}/min 通过；这条生产线上的机器需要 {1}/min（{2}%）"
                    },
                    "Key": "LimiterSolvedFmt"
                },
                {
                    "Source": {
                        "Text": "Only {0}/min is reaching this line; it needs {1}/min"
                    },
                    "Translation": {
                        "Text": "仅有 {0}/min 到达这条生产线；它需要 {1}/min"
                    },
                    "Key": "BlockSolvedSupplyFmt"
                },
                {
                    "Source": {
                        "Text": "Only {0}/min is reaching this line; it needs {1}/min - add or upgrade extraction"
                    },
                    "Translation": {
                        "Text": "仅有 {0}/min 到达这条生产线；它需要 {1}/min - 请增加或升级开采"
                    },
                    "Key": "BlockSolvedExtractFmt"
                },
                {
                    "Source": {
                        "Text": "Outputs full"
                    },
                    "Translation": {
                        "Text": "输出已满"
                    },
                    "Key": "BlockOutputsFull"
                },
                {
                    "Source": {
                        "Text": "Outputs full - {0} has no connected destination and may be backing up (check its disposal)"
                    },
                    "Translation": {
                        "Text": "输出已满 - {0} 没有连接的去向，可能正在积压（请检查其处理方式）"
                    },
                    "Key": "BlockByproductFmt"
                },
                {
                    "Source": {
                        "Text": "Outputs full - {0} of {1} machine(s) stalled"
                    },
                    "Translation": {
                        "Text": "输出已满 - {1} 台机器中有 {0} 台停滞"
                    },
                    "Key": "BlockOutputsFullFmt"
                },
                {
                    "Source": {
                        "Text": "Owned: {0} in storage  ·  {1} in depot  ·  {2} carried"
                    },
                    "Translation": {
                        "Text": "持有：仓储 {0}  ·  次元仓库 {1}  ·  携带 {2}"
                    },
                    "Key": "TipOwnedFmt"
                },
                {
                    "Source": {
                        "Text": "PATH"
                    },
                    "Translation": {
                        "Text": "路径"
                    },
                    "Key": "TabPath"
                },
                {
                    "Source": {
                        "Text": "PAUSED"
                    },
                    "Translation": {
                        "Text": "已暂停"
                    },
                    "Key": "BalanceProblemPaused"
                },
                {
                    "Source": {
                        "Text": "PLAN"
                    },
                    "Translation": {
                        "Text": "计划"
                    },
                    "Key": "TabPlan"
                },
                {
                    "Source": {
                        "Text": "POWER SHARDS"
                    },
                    "Translation": {
                        "Text": "能量碎片"
                    },
                    "Key": "BalanceAugmentShards"
                },
                {
                    "Source": {
                        "Text": "PRODUCED ELSEWHERE · this item is made somewhere in your factory, but no belt or pipe route reaches this line. If a teleporter, portal or loader feeds it, that link cannot be followed"
                    },
                    "Translation": {
                        "Text": "在别处生产 · 此物品在你工厂的某处被生产，但没有传送带或管道路线通到这条生产线。若由传送器、传送门或装载机供货，则无法追踪该连接"
                    },
                    "Key": "BalanceProducedElsewhere"
                },
                {
                    "Source": {
                        "Text": "PRODUCER ISSUES · {0} missing input · {1} output blocked · {2} no power"
                    },
                    "Translation": {
                        "Text": "生产方故障 · {0} 缺少原料 · {1} 输出受阻 · {2} 无电力"
                    },
                    "Key": "BalanceProducerIssueFmt"
                },
                {
                    "Source": {
                        "Text": "PRODUCERS"
                    },
                    "Translation": {
                        "Text": "生产方"
                    },
                    "Key": "BalanceProducersHeading"
                },
                {
                    "Source": {
                        "Text": "Pipe bottleneck: {0} → {1} carries {2} of {3}"
                    },
                    "Translation": {
                        "Text": "管道瓶颈：{0} → {1} 运送 {2}，需 {3}"
                    },
                    "Key": "LimiterPipeConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "Producers have no power"
                    },
                    "Translation": {
                        "Text": "生产方无电力"
                    },
                    "Key": "BlockNoPower"
                },
                {
                    "Source": {
                        "Text": "Producing at {0}/min"
                    },
                    "Translation": {
                        "Text": "以 {0}/min 生产"
                    },
                    "Key": "TipRateFmt"
                },
                {
                    "Source": {
                        "Text": "Production exists, but none reaches the machines that need it"
                    },
                    "Translation": {
                        "Text": "有生产，但没有任何产出到达需要它的机器"
                    },
                    "Key": "BlockSolvedNotConnected"
                },
                {
                    "Source": {
                        "Text": "READY - every remaining part is banked. Delivery is the only step left."
                    },
                    "Translation": {
                        "Text": "已就绪 - 所有剩余零件均已备齐。只差交付这一步。"
                    },
                    "Key": "VerdictReady"
                },
                {
                    "Source": {
                        "Text": "REFRESH"
                    },
                    "Translation": {
                        "Text": "刷新"
                    },
                    "Key": "RefreshReport"
                },
                {
                    "Source": {
                        "Text": "Raw resource - extract it"
                    },
                    "Translation": {
                        "Text": "原始资源 - 请开采"
                    },
                    "Key": "PlanRaw"
                },
                {
                    "Source": {
                        "Text": "Ready to deliver"
                    },
                    "Translation": {
                        "Text": "可交付"
                    },
                    "Key": "StatusReadyToDeliver"
                },
                {
                    "Source": {
                        "Text": "Recipe locked - no purchasable research yet"
                    },
                    "Translation": {
                        "Text": "配方未解锁 - 尚无可购买的研究"
                    },
                    "Key": "GapNoUnlock"
                },
                {
                    "Source": {
                        "Text": "Recipe locked - research: {0}"
                    },
                    "Translation": {
                        "Text": "配方未解锁 - 研究：{0}"
                    },
                    "Key": "GapUnlockFmt"
                },
                {
                    "Source": {
                        "Text": "Recipe locked - research: {0} ({1})"
                    },
                    "Translation": {
                        "Text": "配方未解锁 - 研究：{0}（{1}）"
                    },
                    "Key": "GapUnlockSrcFmt"
                },
                {
                    "Source": {
                        "Text": "Recipe not researched"
                    },
                    "Translation": {
                        "Text": "配方未研究"
                    },
                    "Key": "StatusRecipeLocked"
                },
                {
                    "Source": {
                        "Text": "Recipe not researched"
                    },
                    "Translation": {
                        "Text": "配方未研究"
                    },
                    "Key": "PlanLocked"
                },
                {
                    "Source": {
                        "Text": "Research needed upstream"
                    },
                    "Translation": {
                        "Text": "上游需要研究"
                    },
                    "Key": "SectionResearch"
                },
                {
                    "Source": {
                        "Text": "Research: {0}"
                    },
                    "Translation": {
                        "Text": "研究：{0}"
                    },
                    "Key": "StatusResearchFmt"
                },
                {
                    "Source": {
                        "Text": "Reserve line (standby)"
                    },
                    "Translation": {
                        "Text": "备用生产线（待机）"
                    },
                    "Key": "StatusStandbyReserve"
                },
                {
                    "Source": {
                        "Text": "Route not measured"
                    },
                    "Translation": {
                        "Text": "路线未测量"
                    },
                    "Key": "StatusRouteUnknown"
                },
                {
                    "Source": {
                        "Text": "SERVING CURRENT USE · consumers are using about {0} against {1} demand"
                    },
                    "Translation": {
                        "Text": "满足当前用量 · 消耗方正在使用约 {0}，需求为 {1}"
                    },
                    "Key": "BalanceObservedUseHealthyFmt"
                },
                {
                    "Source": {
                        "Text": "SOMERSLOOPS"
                    },
                    "Translation": {
                        "Text": "SOMERSLOOPS"
                    },
                    "Key": "BalanceAugmentSloops"
                },
                {
                    "Source": {
                        "Text": "STALE - {0}s old (refresh failed)"
                    },
                    "Translation": {
                        "Text": "数据过期 - 已 {0} 秒（刷新失败）"
                    },
                    "Key": "AgeStaleFmt"
                },
                {
                    "Source": {
                        "Text": "SUPPLY LINE  can send {0}  ·  actually arriving {1}"
                    },
                    "Translation": {
                        "Text": "供应线  可输送 {0}  ·  实际到货 {1}"
                    },
                    "Key": "BalanceModelFmt"
                },
                {
                    "Source": {
                        "Text": "SUPPLY MEETS NEED · {0} is reaching consumers; they need {1}"
                    },
                    "Translation": {
                        "Text": "供应满足需求 · {0} 已到达消耗方；它们需要 {1}"
                    },
                    "Key": "BalanceModeledHealthyFmt"
                },
                {
                    "Source": {
                        "Text": "Saturated (surplus)"
                    },
                    "Translation": {
                        "Text": "已饱和（过剩）"
                    },
                    "Key": "StatusSaturated"
                },
                {
                    "Source": {
                        "Text": "Search items or buildings, then press Enter"
                    },
                    "Translation": {
                        "Text": "搜索物品或建筑，然后按 Enter"
                    },
                    "Key": "BalanceFilterHint"
                },
                {
                    "Source": {
                        "Text": "Separate track:"
                    },
                    "Translation": {
                        "Text": "独立分支："
                    },
                    "Key": "PlanExcludedLead"
                },
                {
                    "Source": {
                        "Text": "Showing the {0} lines needing the most attention, of {1} feeding your objective. Search, or filter by problem, to narrow this down."
                    },
                    "Translation": {
                        "Text": "在为你的目标供货的 {1} 条生产线中，显示最需关注的 {0} 条。可搜索或按问题筛选以缩小范围。"
                    },
                    "Key": "BalanceRowsTruncatedFmt"
                },
                {
                    "Source": {
                        "Text": "Showing the {0} lines needing the most attention, of {1} matching your filter."
                    },
                    "Translation": {
                        "Text": "在符合筛选条件的 {1} 条生产线中，显示最需关注的 {0} 条。"
                    },
                    "Key": "BalanceRowsTruncatedFilteredFmt"
                },
                {
                    "Source": {
                        "Text": "Showing {0} of {1} - the rest are counted in the totals above but not listed."
                    },
                    "Translation": {
                        "Text": "显示 {1} 项中的 {0} 项 - 其余已计入上方总计但未列出。"
                    },
                    "Key": "BalanceEndpointsTruncatedFmt"
                },
                {
                    "Source": {
                        "Text": "Spent fuel - burn {0} in a Nuclear Power Plant"
                    },
                    "Translation": {
                        "Text": "乏燃料 - 在核电站中燃烧 {0}"
                    },
                    "Key": "PlanSpentFuelFmt"
                },
                {
                    "Source": {
                        "Text": "Starved - the delivery path could not be fully checked; inspect its connections"
                    },
                    "Translation": {
                        "Text": "断料 - 交付路径无法完整检查；请检查其连接"
                    },
                    "Key": "BlockConnectivityUnknown"
                },
                {
                    "Source": {
                        "Text": "Still needed: {0}  (banked {1}, to produce {2})"
                    },
                    "Translation": {
                        "Text": "仍需：{0}  （已备 {1}，待生产 {2}）"
                    },
                    "Key": "TipNeededFmt"
                },
                {
                    "Source": {
                        "Text": "Supply {0}/min vs demand {1}/min - add capacity"
                    },
                    "Translation": {
                        "Text": "供应 {0}/min 对需求 {1}/min - 请增加产能"
                    },
                    "Key": "BlockSupplyFmt"
                },
                {
                    "Source": {
                        "Text": "The feeding line could not be identified - inspect the connected producers"
                    },
                    "Translation": {
                        "Text": "无法识别供货生产线 - 请检查已连接的生产方"
                    },
                    "Key": "BlockPathAttributionMissing"
                },
                {
                    "Source": {
                        "Text": "The host cannot send a report"
                    },
                    "Translation": {
                        "Text": "主机无法发送报告"
                    },
                    "Key": "NoRelayHeadline"
                },
                {
                    "Source": {
                        "Text": "The host could not produce a report"
                    },
                    "Translation": {
                        "Text": "主机未能生成报告"
                    },
                    "Key": "HostDeclinedHeadline"
                },
                {
                    "Source": {
                        "Text": "The machines can supply {0}, but only {1} reaches consumers; inspect the route between them"
                    },
                    "Translation": {
                        "Text": "这些机器可供应 {0}，但只有 {1} 到达消耗方；请检查两者之间的路线"
                    },
                    "Key": "LimiterRoutingConstraintFmt"
                },
                {
                    "Source": {
                        "Text": "This client asked the host for a report, but the host is not running a version of Critical Path that can send one. Ask the host to update, or open the panel on the host."
                    },
                    "Translation": {
                        "Text": "此客户端已向主机请求报告，但主机运行的 Critical Path 版本无法发送报告。请让主机更新，或在主机上打开该面板。"
                    },
                    "Key": "NoRelayDetail"
                },
                {
                    "Source": {
                        "Text": "This reading is out of date - press REFRESH"
                    },
                    "Translation": {
                        "Text": "此读数已过期 - 请按刷新"
                    },
                    "Key": "BlockLegacyLogistics"
                },
                {
                    "Source": {
                        "Text": "Time-limited"
                    },
                    "Translation": {
                        "Text": "时间受限"
                    },
                    "Key": "StatusTimeLimited"
                },
                {
                    "Source": {
                        "Text": "To research {0}  ({1}):"
                    },
                    "Translation": {
                        "Text": "要研究 {0}  （{1}）："
                    },
                    "Key": "ResearchPlanHeadFmt"
                },
                {
                    "Source": {
                        "Text": "Transport route is known; vehicle throughput is not yet measured."
                    },
                    "Translation": {
                        "Text": "运输路线已知；载具吞吐量尚未测量。"
                    },
                    "Key": "TransportTopologyOnly"
                },
                {
                    "Source": {
                        "Text": "Under-supplied"
                    },
                    "Translation": {
                        "Text": "供应不足"
                    },
                    "Key": "StatusUnderSupplied"
                },
                {
                    "Source": {
                        "Text": "Unlocked by {0} - your SELECTED milestone: its payment progress is the Milestone column →"
                    },
                    "Translation": {
                        "Text": "由 {0} 解锁 - 你所选的里程碑：其缴付进度见里程碑列 →"
                    },
                    "Key": "ResearchIsSelectedFmt"
                },
                {
                    "Source": {
                        "Text": "Vehicle route connected - delivery rate unknown because throughput is not yet measured"
                    },
                    "Translation": {
                        "Text": "载具路线已连接 - 交付速率未知，因为吞吐量尚未测量"
                    },
                    "Key": "BlockTransportRateUnknown"
                },
                {
                    "Source": {
                        "Text": "blocked by {0} on the belt"
                    },
                    "Translation": {
                        "Text": "被传送带上的 {0} 卡住"
                    },
                    "Key": "EndpointStateJammedFmt"
                },
                {
                    "Source": {
                        "Text": "buffer {0} {1}"
                    },
                    "Translation": {
                        "Text": "缓冲 {0} {1}"
                    },
                    "Key": "EndpointBufferFmt"
                },
                {
                    "Source": {
                        "Text": "downstream node"
                    },
                    "Translation": {
                        "Text": "下游节点"
                    },
                    "Key": "LimiterEdgeDownstreamFallback"
                },
                {
                    "Source": {
                        "Text": "from the host, earlier (latest request failed)"
                    },
                    "Translation": {
                        "Text": "来自主机，较早（最近一次请求失败）"
                    },
                    "Key": "AgeHostStale"
                },
                {
                    "Source": {
                        "Text": "from the host, just now"
                    },
                    "Translation": {
                        "Text": "来自主机，刚刚"
                    },
                    "Key": "AgeFromHost"
                },
                {
                    "Source": {
                        "Text": "hard drive"
                    },
                    "Translation": {
                        "Text": "硬盘"
                    },
                    "Key": "SrcHardDrive"
                },
                {
                    "Source": {
                        "Text": "idle - no fault reported"
                    },
                    "Translation": {
                        "Text": "空闲 - 未报告故障"
                    },
                    "Key": "EndpointStateIdle"
                },
                {
                    "Source": {
                        "Text": "is not in this plan - its recipe is not unlocked yet"
                    },
                    "Translation": {
                        "Text": "不在此计划中 - 其配方尚未解锁"
                    },
                    "Key": "PlanExcludedWhyUnknown"
                },
                {
                    "Source": {
                        "Text": "is not in this plan - its recipe unlocks with {0}"
                    },
                    "Translation": {
                        "Text": "不在此计划中 - 其配方随 {0} 解锁"
                    },
                    "Key": "PlanExcludedWhyFmt"
                },
                {
                    "Source": {
                        "Text": "items"
                    },
                    "Translation": {
                        "Text": "个"
                    },
                    "Key": "EndpointBufferItems"
                },
                {
                    "Source": {
                        "Text": "items"
                    },
                    "Translation": {
                        "Text": "个"
                    },
                    "Key": "BufferItems"
                },
                {
                    "Source": {
                        "Text": "items/min"
                    },
                    "Translation": {
                        "Text": "个/min"
                    },
                    "Key": "BalanceSolidRateUnit"
                },
                {
                    "Source": {
                        "Text": "just now"
                    },
                    "Translation": {
                        "Text": "刚刚"
                    },
                    "Key": "AgeJustNow"
                },
                {
                    "Source": {
                        "Text": "just now"
                    },
                    "Translation": {
                        "Text": "刚刚"
                    },
                    "Key": "AgeJustNowFlow"
                },
                {
                    "Source": {
                        "Text": "machine"
                    },
                    "Translation": {
                        "Text": "机器"
                    },
                    "Key": "LimiterMachineFallback"
                },
                {
                    "Source": {
                        "Text": "made by {0}  ·  used by {1}{2}"
                    },
                    "Translation": {
                        "Text": "由 {0} 生产  ·  由 {1} 使用{2}"
                    },
                    "Key": "BalanceIdentityFmt"
                },
                {
                    "Source": {
                        "Text": "milestone"
                    },
                    "Translation": {
                        "Text": "里程碑"
                    },
                    "Key": "SrcMilestone"
                },
                {
                    "Source": {
                        "Text": "missing input"
                    },
                    "Translation": {
                        "Text": "缺少原料"
                    },
                    "Key": "EndpointStateMissingInput"
                },
                {
                    "Source": {
                        "Text": "m³"
                    },
                    "Translation": {
                        "Text": "m³"
                    },
                    "Key": "BufferM3"
                },
                {
                    "Source": {
                        "Text": "m³"
                    },
                    "Translation": {
                        "Text": "m³"
                    },
                    "Key": "EndpointBufferM3"
                },
                {
                    "Source": {
                        "Text": "m³/min"
                    },
                    "Translation": {
                        "Text": "m³/min"
                    },
                    "Key": "BalanceFluidRateUnit"
                },
                {
                    "Source": {
                        "Text": "no connected consumer"
                    },
                    "Translation": {
                        "Text": "无已连接的消耗方"
                    },
                    "Key": "BalanceNoConsumer"
                },
                {
                    "Source": {
                        "Text": "no data - {0}"
                    },
                    "Translation": {
                        "Text": "无数据 - {0}"
                    },
                    "Key": "AgeErrorFmt"
                },
                {
                    "Source": {
                        "Text": "no power"
                    },
                    "Translation": {
                        "Text": "无电力"
                    },
                    "Key": "EndpointStateNoPower"
                },
                {
                    "Source": {
                        "Text": "no producer"
                    },
                    "Translation": {
                        "Text": "无生产方"
                    },
                    "Key": "BalanceNoProducer"
                },
                {
                    "Source": {
                        "Text": "output full (nothing taking it)"
                    },
                    "Translation": {
                        "Text": "输出已满（无人取用）"
                    },
                    "Key": "EndpointStateOutputBlocked"
                },
                {
                    "Source": {
                        "Text": "paused"
                    },
                    "Translation": {
                        "Text": "已暂停"
                    },
                    "Key": "EndpointStatePaused"
                },
                {
                    "Source": {
                        "Text": "producing"
                    },
                    "Translation": {
                        "Text": "生产中"
                    },
                    "Key": "EndpointStateProducing"
                },
                {
                    "Source": {
                        "Text": "re-measuring..."
                    },
                    "Translation": {
                        "Text": "重新测量中…"
                    },
                    "Key": "AgeRefreshing"
                },
                {
                    "Source": {
                        "Text": "state unavailable"
                    },
                    "Translation": {
                        "Text": "状态不可用"
                    },
                    "Key": "EndpointStateUnavailable"
                },
                {
                    "Source": {
                        "Text": "the {0} elevator phase"
                    },
                    "Translation": {
                        "Text": "{0} 太空电梯阶段"
                    },
                    "Key": "PlanForPhaseFmt"
                },
                {
                    "Source": {
                        "Text": "the {0} milestone"
                    },
                    "Translation": {
                        "Text": "{0} 里程碑"
                    },
                    "Key": "PlanForMilestoneFmt"
                },
                {
                    "Source": {
                        "Text": "unavailable here"
                    },
                    "Translation": {
                        "Text": "此处不可用"
                    },
                    "Key": "AgeUnavailable"
                },
                {
                    "Source": {
                        "Text": "upstream node"
                    },
                    "Translation": {
                        "Text": "上游节点"
                    },
                    "Key": "LimiterEdgeUpstreamFallback"
                },
                {
                    "Source": {
                        "Text": "waiting on {0}"
                    },
                    "Translation": {
                        "Text": "等待 {0}"
                    },
                    "Key": "EndpointStateStarvedFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Add 1 average {1} → about {2} reaching consumers ({3}%)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  增加 1 个平均水平的 {1} → 约 {2} 可到达消耗方（{3}%）"
                    },
                    "Key": "LimiterExactMachineMarginalFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Alt recipes exist"
                    },
                    "Translation": {
                        "Text": "{0}  ·  存在替代配方"
                    },
                    "Key": "PlanAltFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Spare capacity unavailable - one or more routes could not be fully measured"
                    },
                    "Translation": {
                        "Text": "{0}  ·  无法得知余量 - 有一条或多条路线未能完整测量"
                    },
                    "Key": "PlanGraftUnknownFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Spare {1}/min, needs {2}/min ({3}%)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  余量 {1}/min，需要 {2}/min（{3}%）"
                    },
                    "Key": "PlanGraftRatioFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Stored buffer covers ~{1} min"
                    },
                    "Translation": {
                        "Text": "{0}  ·  库存缓冲可支撑约 {1} 分钟"
                    },
                    "Key": "LimiterBufferFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Stored buffer is dry"
                    },
                    "Translation": {
                        "Text": "{0}  ·  库存缓冲已耗尽"
                    },
                    "Key": "LimiterBufferDryFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Upgrade this belt to {1} → about {2} reaching consumers ({3}%)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  将此传送带升级为 {1} → 约 {2} 可到达消耗方（{3}%）"
                    },
                    "Key": "LimiterExactBeltMarginalFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  Upgrade this pipe to {1} → about {2} reaching consumers ({3}%)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  将此管道升级为 {1} → 约 {2} 可到达消耗方（{3}%）"
                    },
                    "Key": "LimiterExactPipeMarginalFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  delivery rate unknown on {1} route(s)"
                    },
                    "Translation": {
                        "Text": "{0}  ·  {1} 条路线的交付速率未知"
                    },
                    "Key": "LimiterUnknownFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  line {1}"
                    },
                    "Translation": {
                        "Text": "{0}  ·  生产线 {1}"
                    },
                    "Key": "BalanceTitleMultiFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  more not shown"
                    },
                    "Translation": {
                        "Text": "{0}  ·  还有未显示的项"
                    },
                    "Key": "PlanTruncFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  one more {1} would reach {2}%"
                    },
                    "Translation": {
                        "Text": "{0}  ·  再加 1 个 {1} 可达到 {2}%"
                    },
                    "Key": "LimiterMarginalFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  only {1} of {2} checked - too many to scan"
                    },
                    "Translation": {
                        "Text": "{0}  ·  {2} 项中仅检查了 {1} 项 - 数量过多，无法全部扫描"
                    },
                    "Key": "TruncFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  {1}"
                    },
                    "Translation": {
                        "Text": "{0}  ·  {1}"
                    },
                    "Key": "LimiterConstraintJoinFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  {1} checked - some supporting detail limited"
                    },
                    "Translation": {
                        "Text": "{0}  ·  已检查 {1} - 部分辅助细节受限"
                    },
                    "Key": "TruncDetailFmt"
                },
                {
                    "Source": {
                        "Text": "{0}  ·  {1}: {2}"
                    },
                    "Translation": {
                        "Text": "{0}  ·  {1}：{2}"
                    },
                    "Key": "VerdictPlanFaultFmt"
                },
                {
                    "Source": {
                        "Text": "{0} ({1})"
                    },
                    "Translation": {
                        "Text": "{0}（{1}）"
                    },
                    "Key": "PlanUnlockNameFmt"
                },
                {
                    "Source": {
                        "Text": "{0} - {1}"
                    },
                    "Translation": {
                        "Text": "{0} - {1}"
                    },
                    "Key": "BalanceAnchorPingFmt"
                },
                {
                    "Source": {
                        "Text": "{0} - {1} - {2}"
                    },
                    "Translation": {
                        "Text": "{0} - {1} - {2}"
                    },
                    "Key": "BalanceEndpointPingFmt"
                },
                {
                    "Source": {
                        "Text": "{0} delivered"
                    },
                    "Translation": {
                        "Text": "{0} 已交付"
                    },
                    "Key": "LedgerDeliveredFmt"
                },
                {
                    "Source": {
                        "Text": "{0} delivered"
                    },
                    "Translation": {
                        "Text": "{0} 已交付"
                    },
                    "Key": "SummaryDoneFmt"
                },
                {
                    "Source": {
                        "Text": "{0} need a fix"
                    },
                    "Translation": {
                        "Text": "{0} 需要修复"
                    },
                    "Key": "SummaryBlockedFmt"
                },
                {
                    "Source": {
                        "Text": "{0} needed  ·  {0} banked  ·  {1}"
                    },
                    "Translation": {
                        "Text": "需要 {0}  ·  已备 {0}  ·  {1}"
                    },
                    "Key": "LedgerBankedFmt"
                },
                {
                    "Source": {
                        "Text": "{0} needed  ·  {1}"
                    },
                    "Translation": {
                        "Text": "需要 {0}  ·  {1}"
                    },
                    "Key": "LedgerNoBankFmt"
                },
                {
                    "Source": {
                        "Text": "{0} needed  ·  {1} banked  ·  {2}"
                    },
                    "Translation": {
                        "Text": "需要 {0}  ·  已备 {1}  ·  {2}"
                    },
                    "Key": "ResearchCostLedgerFmt"
                },
                {
                    "Source": {
                        "Text": "{0} needed  ·  {1} banked  ·  {2} to produce  ·  {3}"
                    },
                    "Translation": {
                        "Text": "需要 {0}  ·  已备 {1}  ·  待生产 {2}  ·  {3}"
                    },
                    "Key": "LedgerFullFmt"
                },
                {
                    "Source": {
                        "Text": "{0} ready to deliver"
                    },
                    "Translation": {
                        "Text": "{0} 可交付"
                    },
                    "Key": "SummaryReadyFmt"
                },
                {
                    "Source": {
                        "Text": "{0} still to build"
                    },
                    "Translation": {
                        "Text": "{0} 待建造"
                    },
                    "Key": "SummaryToBuildFmt"
                },
                {
                    "Source": {
                        "Text": "{0} {0}|plural(one=part,other=parts)"
                    },
                    "Translation": {
                        "Text": "{0} 个零件"
                    },
                    "Key": "SummaryPartsFmt"
                },
                {
                    "Source": {
                        "Text": "{0} {1}"
                    },
                    "Translation": {
                        "Text": "{0} {1}"
                    },
                    "Key": "BalanceRateWithUnitFmt"
                },
                {
                    "Source": {
                        "Text": "{0}% productivity"
                    },
                    "Translation": {
                        "Text": "{0}% 生产率"
                    },
                    "Key": "EndpointProductivityFmt"
                },
                {
                    "Source": {
                        "Text": "{0})  Build:"
                    },
                    "Translation": {
                        "Text": "{0})  建造："
                    },
                    "Key": "PlanStepBuildFmt"
                },
                {
                    "Source": {
                        "Text": "{0})  Fix:"
                    },
                    "Translation": {
                        "Text": "{0})  修复："
                    },
                    "Key": "PlanStepFixFmt"
                },
                {
                    "Source": {
                        "Text": "{0})  Unlock:"
                    },
                    "Translation": {
                        "Text": "{0})  解锁："
                    },
                    "Key": "PlanStepUnlockFmt"
                },
                {
                    "Source": {
                        "Text": "{0}. {1} - {2}"
                    },
                    "Translation": {
                        "Text": "{0}. {1} - {2}"
                    },
                    "Key": "BalanceEndpointFmt"
                },
                {
                    "Source": {
                        "Text": "~{0} min remaining"
                    },
                    "Translation": {
                        "Text": "剩余约 {0} 分钟"
                    },
                    "Key": "StatusEtaFmt"
                },
                {
                    "Source": {
                        "Text": "→ for {0}"
                    },
                    "Translation": {
                        "Text": "→ 用于 {0}"
                    },
                    "Key": "PlanItemForFmt"
                },
                {
                    "Source": {
                        "Text": "→ makes {0} buildable"
                    },
                    "Translation": {
                        "Text": "→ 使 {0} 可建造"
                    },
                    "Key": "PlanUnlockMakesFmt"
                },
                {
                    "Source": {
                        "Text": "▼"
                    },
                    "Translation": {
                        "Text": ""
                    },
                    "Key": "BalanceExpandChevron"
                }
            ]
        }
    ]
}